IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MPU_SCRM2SCRP1_MPU_SCRM2SCRP1.xml
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_1_START_ADDRESS" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_1_START_ADDRESS" offset="0x200" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_1_END_ADDRESS" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_1_END_ADDRESS" offset="0x204" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_1_MPPA" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_1_MPPA" offset="0x208" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Always read as 0." range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25 - 10" rwaccess="RW"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Non-secure permission. Defaults to input value." range="7" rwaccess="RW"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="RW"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="RW"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="RW"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="RW"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="RW"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="RW"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_2_START_ADDRESS" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_2_START_ADDRESS" offset="0x210" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_2_END_ADDRESS" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_2_END_ADDRESS" offset="0x214" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_2_MPPA" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_2_MPPA" offset="0x218" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Always read as 0." range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="AIDs checked for this region. Defaults to input value.0 = AID is not checked for these permissions.1 = AID is checked for these permissions." range="25 - 10" rwaccess="RW"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Additional AIDs checked. Defaults to input value." range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Non-secure permission. Defaults to input value." range="7" rwaccess="RW"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Debug permission. Defaults to input value." range="6" rwaccess="RW"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Supervisor read permission. Defaults to input value." range="5" rwaccess="RW"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Supervisor write permission. Defaults to input value." range="4" rwaccess="RW"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Supervisor executable permission. Defaults to input value." range="3" rwaccess="RW"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="User read permission. Defaults to input value." range="2" rwaccess="RW"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="User write permission. Defaults to input value." range="1" rwaccess="RW"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="User executable permission. Defaults to input value." range="0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_3_START_ADDRESS" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_3_START_ADDRESS" offset="0x220" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Start address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP1_PROGRAMMABLE_3_END_ADDRESS" acronym="MPU_SCRM2SCRP1_PROGRAMMABLE_3_END_ADDRESS" offset="0x224" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="End address for range N. Defaults to input signal value." range="31 - 0" rwaccess="RW"/>
	</register>
